{
  "batsuits": [
    {
      "id": 1,
      "title": "Batman",
      "year": 1943,
      "img": "../img/batman-1943.jpg",
      "detail": "In the 'Batman' and 'Batman and Robin' serials, the first time the Caped Crusader graced the screen, The Dark Knight wore a long-snouted cowl and floppy ears that are a far cry from the more familiarly armored appearance associated with Batman today."
    },
    {
      "id": 2,
      "title": "Batman",
      "year": 1966,
      "img": "../img/batman-1966.jpg",
      "detail": "Adam West's Batsuit lightened in tone to parallel the comical television portrayal of the Caped Crusader, known for its camp and silly style."
    },
    {
      "id": 3,
      "title": "Batman",
      "year": 1989,
      "img": "../img/batman-1989.jpg",
      "detail": "Tim Burton's Batman introduced a much darker version of the Dark Knight. This Batsuit introduced the grapple gun among a bevy of other gadgets, and also became the template for future designs."
    },
    {
      "id": 4,
      "title": "Batman Returns",
      "year": 1992,
      "img": "../img/batman-1992.jpg",
      "detail": "Burton's sequel brought changes to the Batsuit's emblem and overall design. Batman's chest and abs look less anatomic and more armored here."
    },
    {
      "id": 5,
      "title": "Batman Forever",
      "year": 1995,
      "img": "../img/batman-1995.jpg",
      "detail": "Joel Schumacher's Batman Forever added more theatricality to the Batsuit, greatly highlighting an implied musculature, and adding the controversial bat nipples."
    },
    {
      "id": 6,
      "title": "Batman & Robin",
      "year": 1997,
      "img": "../img/batman-1997.jpg",
      "detail": "Widely considered the worst superhero film ever made, in Batman & Robin Schumacher added a brighter sheen to the Batsuit, and introduced ice-themed variants. He did, however, also keep the nipples and exaggerated codpieces."
    },
    {
      "id": 7,
      "title": "Batman Begins",
      "year": 2005,
      "img": "../img/batman-2005.jpg",
      "detail": "Christopher Nolan's entry into the bat franchise brought a darker version of Gotham's Knight, much more militaristic and grounded in realism."
    },
    {
      "id": 8,
      "title": "The Dark Knight",
      "year": 2008,
      "img": "../img/batman-2008.jpg",
      "detail": "Nolan's Batsuit exhibits a more armored and defined look in the sequels, where individual plates are added in the name of mobility (and the long sought after ability for an actor to turn their head)."
    },
    {
      "id": 9,
      "title": "Batman v. Superman: Dawn of Justice",
      "year": 2016,
      "img": "../img/batman-2016.jpg",
      "detail": "The Ben Affleck Batsuit was heavily based around the 'Dark Knight Returns' graphic novel, eschewing obvious armor for the sake of musculature and texture, along with shorter ears and a more menacing cowl."
    },
    {
      "id": 10,
      "title": "Justice League",
      "year": 2017,
      "img": "../img/batman-2017.jpg",
      "detail": "With small changes to the Batsuit seen a year earlier, the Justice League Batman was slightly sleeker and more refined, with a darker monochromatic tone throughout the suit."
    },
    {
      "id": 11,
      "title": "The Batman",
      "year": 2021,
      "img": "../img/batman-2021.jpeg",
      "detail": "2021's The Batman is still in early production, but a glimpse of the Batsuit from a stunt-double on set implies a more properly armored suit, with sharp, rounded ears."
    }
  ]
}
